# RebarShapeOutOfPlaneBendDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarShapeOutOfPlaneBendDiameter Property
ParameterTypeId Class See Also
---
"Out of Plane Bend Diameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarShapeOutOfPlaneBendDiameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeOutOfPlaneBendDiameter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarShapeOutOfPlaneBendDiameter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace